In [2]:
import pandas as pd
import datetime as dt
import pytz
import os

In [7]:
#final code_block <- works

def mod_concat_NEM(file_path):
    df = pd.read_pickle(file_path)
    df = df.set_index('PeriodID', drop=True)
    df.index = pd.to_datetime(df.index).tz_localize(None)
    print(df.info())
    df.sort_index(inplace=True, ascending=False)
    df.index = df.index - dt.timedelta(minutes = 5)
    df = df.loc[df.index < dt.datetime(2018,8,1), :]
    return df

In [8]:
file = '{}/nem-data/nemde_clean/concat_for_energy_SA1'.format(os.environ['HOME'])

df = mod_concat_NEM(file)

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 5951880 entries, 2015-06-23 13:40:00 to 2012-01-11 12:45:00
Data columns (total 9 columns):
RegionID            object
Market              object
Price               object
Unit                object
DispatchedMarket    object
BandNo              object
Increase            object
RRNBandPrice        object
BandCost            object
dtypes: object(9)
memory usage: 454.1+ MB
None

In [192]:
df.drop(columns=["BandNo","RRNBandPrice","BandCost"], inplace=True)

In [193]:
df[["Price", "Increase"]] = df[["Price", "Increase"]].astype(float)

In [219]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 5951707 entries, 2018-07-31 23:55:00 to 2009-07-01 04:00:00
Data columns (total 6 columns):
RegionID            object
Market              object
Price               float64
Unit                object
DispatchedMarket    object
Increase            float64
dtypes: float64(2), object(4)
memory usage: 357.9+ MB

In [218]:
df.isna().any()

RegionID            False
Market              False
Price               False
Unit                False
DispatchedMarket    False
Increase            False
dtype: bool

In [29]:
df.head(20)

,RegionID,Market,Price,Unit,DispatchedMarket,BandNo,Increase,RRNBandPrice,BandCost
PeriodID,,,,,,,,,
2018-07-31 23:55:00,SA1,Energy,70.70204,ER01,ENOF,3,0.34712,53.75,18.657483
2018-07-31 23:55:00,SA1,Energy,70.70204,ER04,ENOF,3,0.31058,53.75,16.693537
2018-07-31 23:55:00,SA1,Energy,70.70204,ER03,ENOF,3,0.34712,53.75,18.657483
2018-07-31 23:55:00,SA1,Energy,70.70204,ER02,ENOF,3,0.31058,53.75,16.693537
2018-07-31 23:50:00,SA1,Energy,69.24109,DEVILS_G,L5MI,4,-1.29132,0.14,-0.180785
2018-07-31 23:50:00,SA1,Energy,69.24109,ER01,ENOF,3,0.64566,53.75,34.704259
2018-07-31 23:50:00,SA1,Energy,69.24109,ER01,L5RE,1,0.64566,0.01,0.006457
2018-07-31 23:50:00,SA1,Energy,69.24109,"ENOF,ER01,3,ER02,3",tbslack1,NaN,109.76231,0,0.00011
2018-07-31 23:50:00,SA1,Energy,69.24109,"ENOF,ER03,3,ER04,3",tbslack1,NaN,109.76231,0,0.00011
2018-07-31 23:50:00,SA1,Energy,69.24109,ER03,L5RE,1,0.64566,0.01,0.006457
2018-07-31 23:50:00,SA1,Energy,69.24109,"ENOF,ER01,3,ER04,3",tbslack1,NaN,109.76231,0,0.00011
2018-07-31 23:50:00,SA1,Energy,69.24109,ER03,ENOF,3,0.64566,53.75,34.704259
2018-07-31 23:50:00,SA1,Energy,69.24109,"ENOF,ER02,3,ER03,3",tbslack2,NaN,109.76231,0,0.00011
2018-07-31 23:45:00,SA1,Energy,69.9485,ER01,ENOF,3,0.34342,53.75,18.458632
2018-07-31 23:45:00,SA1,Energy,69.9485,ER04,ENOF,3,0.30727,53.75,16.515618
2018-07-31 23:45:00,SA1,Energy,69.9485,ER02,ENOF,3,0.30727,53.75,16.515618
2018-07-31 23:45:00,SA1,Energy,69.9485,ER03,ENOF,3,0.34342,53.75,18.458632
2018-07-31 23:40:00,SA1,Energy,74.04497,VP5,ENOF,4,0.63832,58,37.022487
2018-07-31 23:40:00,SA1,Energy,74.04497,VP6,ENOF,4,0.63832,58,37.022487
2018-07-31 23:35:00,SA1,Energy,76.44245,"ENOF,GSTONE1,5,GSTONE5,5",tbslack1,NaN,16.45455,0,0.000016

In [22]:
df.shape

(5951707, 9)

In [195]:
df_price_count = df.groupby("PeriodID").agg({"Price" : "count"}).sort_values(by="PeriodID", ascending=False)
df_price_count

                     Price
PeriodID
2018-07-31 23:55:00      4
2018-07-31 23:50:00      9
2018-07-31 23:45:00      4
2018-07-31 23:40:00      2
2018-07-31 23:35:00     12
...                    ...
2009-07-01 04:20:00      8
2009-07-01 04:15:00      6
2009-07-01 04:10:00      2
2009-07-01 04:05:00      2
2009-07-01 04:00:00      6

[946847 rows x 1 columns]

In [196]:
df_price_count[(df_price_count.index == dt.datetime(2015,2,22,23,30,0)) | 
   (df_price_count.index == dt.datetime(2015,5,1,8,40,0)) | 
   (df_price_count.index == dt.datetime(2016,10,31,20,30,0))]

                     Price
PeriodID
2016-10-31 20:30:00     15
2015-05-01 08:40:00     41
2015-02-22 23:30:00      8

In [197]:
df_grouped = df.groupby("PeriodID").agg({"Price" : "nunique"})
df_grouped

                     Price
PeriodID
2009-07-01 04:00:00      1
2009-07-01 04:05:00      1
2009-07-01 04:10:00      1
2009-07-01 04:15:00      1
2009-07-01 04:20:00      1
...                    ...
2018-07-31 23:35:00      1
2018-07-31 23:40:00      1
2018-07-31 23:45:00      1
2018-07-31 23:50:00      1
2018-07-31 23:55:00      1

[946847 rows x 1 columns]

In [198]:
df_grouped.Price.value_counts()

1    946844
2         3
Name: Price, dtype: int64

In [199]:
df_grouped.loc[df_grouped.Price == 2]

                     Price
PeriodID
2015-02-22 23:30:00      2
2015-05-01 08:40:00      2
2016-10-31 20:30:00      2

In [201]:
df_outlier = df[(df.index == dt.datetime(2015,2,22,23,30,0)) | 
   (df.index == dt.datetime(2015,5,1,8,40,0)) | 
   (df.index == dt.datetime(2016,10,31,20,30,0))]

In [202]:
df_outlier.groupby('PeriodID').agg({'Price' : ['min', 'max']})

                           Price
                             min           max
PeriodID
2015-02-22 23:30:00  97591.06624  368100.07478
2015-05-01 08:40:00     70.29670      72.09740
2016-10-31 20:30:00     95.98007  509229.65442

In [139]:
df_dispatch = pd.read_csv('/home/bastian/nem-data/clean/dispatch_price.csv', index_col = 0, parse_dates=True)

In [140]:
df_dispatch = df_dispatch.loc[(df_dispatch.index <= df.index.max()) &
                              (df_dispatch.index >= df.index.min()), :][['RRP SA1']]
df_dispatch.sort_index(ascending=False, inplace=True)
print(df_dispatch.shape)
df_dispatch.head()

(955536, 1)

                       RRP SA1
tempus_interval_time
2018-07-31 23:55:00   70.70204
2018-07-31 23:50:00   69.24109
2018-07-31 23:45:00   69.94850
2018-07-31 23:40:00   74.04497
2018-07-31 23:35:00   76.44245

In [101]:
df_dispatch.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 955534 entries, 2018-07-31 23:50:00 to 2009-07-01 04:05:00
Data columns (total 1 columns):
RRP SA1    955534 non-null float64
dtypes: float64(1)
memory usage: 14.6 MB

In [145]:
print(df.index.max())
print(df.index.min())
print(df_grouped.shape)

2018-07-31 23:55:00
2009-07-01 04:00:00
(946847, 1)

In [143]:
print(df_dispatch.index.max())
print(df_dispatch.index.min())
print(df_dispatch.shape)

2018-07-31 23:55:00
2009-07-01 04:00:00
(955536, 1)

In [207]:
df_group_price = df.groupby("PeriodID").agg({"Price":"mean"}).sort_values(by="PeriodID",ascending=False)
df_group_price

                        Price
PeriodID
2018-07-31 23:55:00  70.70204
2018-07-31 23:50:00  69.24109
2018-07-31 23:45:00  69.94850
2018-07-31 23:40:00  74.04497
2018-07-31 23:35:00  76.44245
...                       ...
2009-07-01 04:20:00   1.75480
2009-07-01 04:15:00   1.44014
2009-07-01 04:10:00  -0.00006
2009-07-01 04:05:00  -0.00006
2009-07-01 04:00:00   1.35918

[946847 rows x 1 columns]

In [208]:
df_join = df_group_price.join(df_dispatch, how='inner')

In [209]:
df_join.shape

(946847, 2)

In [210]:
df_join.head()

                        Price   RRP SA1
2018-07-31 23:55:00  70.70204  70.70204
2018-07-31 23:50:00  69.24109  69.24109
2018-07-31 23:45:00  69.94850  69.94850
2018-07-31 23:40:00  74.04497  74.04497
2018-07-31 23:35:00  76.44245  76.44245

In [215]:
df_join.isna().any()

Price      False
RRP SA1    False
dtype: bool

In [234]:
df_join["delta"] = (df_join["Price"] - df_join["RRP SA1"])

In [235]:
df_join.head()

                        Price   RRP SA1         delta
2018-07-31 23:55:00  70.70204  70.70204  0.000000e+00
2018-07-31 23:50:00  69.24109  69.24109  0.000000e+00
2018-07-31 23:45:00  69.94850  69.94850  0.000000e+00
2018-07-31 23:40:00  74.04497  74.04497  2.842171e-14
2018-07-31 23:35:00  76.44245  76.44245  0.000000e+00

In [236]:
sum(((df_join["Price"] - df_join["RRP SA1"])/df_join["RRP SA1"]) > 0.00001)/df_join.shape[0]

0.0015145002307658999

In [245]:
delta = df_join[((df_join["Price"] - df_join["RRP SA1"])/df_join["RRP SA1"]) > 0.00001]
delta

                            Price   RRP SA1         delta
2018-04-27 18:50:00  426000.00401  14200.00  411800.00401
2018-04-27 18:45:00  426000.00403  14200.00  411800.00403
2018-04-26 11:30:00  426000.00385  14200.00  411800.00385
2018-04-26 11:25:00  426000.00411  14200.00  411800.00411
2018-02-08 01:00:00   14673.29560    590.01   14083.28560
...                           ...       ...           ...
2010-02-09 16:20:00   14400.99847  10000.00    4400.99847
2010-02-09 16:15:00   67111.08534  10000.00   57111.08534
2010-02-09 16:10:00   14555.63082  10000.00    4555.63082
2009-09-11 19:25:00   22836.25512  10000.00   12836.25512
2009-09-11 19:20:00   89871.44194  10000.00   79871.44194

[1434 rows x 3 columns]

In [238]:
print(df_join.delta.min())
print(df_join.delta.max())

-25801.01056999999
2099937.02

In [261]:
df_join.head()

                        Price   RRP SA1         delta
2018-07-31 23:55:00  70.70204  70.70204  0.000000e+00
2018-07-31 23:50:00  69.24109  69.24109  0.000000e+00
2018-07-31 23:45:00  69.94850  69.94850  0.000000e+00
2018-07-31 23:40:00  74.04497  74.04497  2.842171e-14
2018-07-31 23:35:00  76.44245  76.44245  0.000000e+00

In [269]:
df_join_delta = df_join.drop(delta.index) #cleeeaaan

In [270]:
sum(((df_join_delta["Price"] - df_join_delta["RRP SA1"])/df_join_delta["RRP SA1"]) > 0.00001)

0

In [259]:
df_join_delta.shape

(945413, 3)

In [260]:
df_join_delta.head()

                        Price   RRP SA1         delta
2018-07-31 23:55:00  70.70204  70.70204  0.000000e+00
2018-07-31 23:50:00  69.24109  69.24109  0.000000e+00
2018-07-31 23:45:00  69.94850  69.94850  0.000000e+00
2018-07-31 23:40:00  74.04497  74.04497  2.842171e-14
2018-07-31 23:35:00  76.44245  76.44245  0.000000e+00

In [243]:
df_mismatch = df_dispatch.drop(df_join.index)

In [244]:
df_mismatch.head()

                       RRP SA1
tempus_interval_time
2018-07-01 03:55:00   78.74000
2018-07-01 03:50:00   78.74000
2018-07-01 03:45:00   78.74000
2018-07-01 03:40:00   78.74000
2018-07-01 03:35:00   86.83353

In [168]:
df_mismatch.groupby([df_mismatch.index.year, df_mismatch.index.month]).mean()

                                              RRP SA1
tempus_interval_time tempus_interval_time
2009                 8                       0.000000
                     9                       0.000000
2010                 1                       0.000000
                     3                       0.000000
                     9                       0.000000
                     12                     12.251030
2013                 8                      80.800090
                     11                      0.000000
2016                 1                      33.996890
                     3                      51.317500
                     8                       0.000000
                     9                       0.000000
                     10                      0.000000
                     11                      0.000000
2017                 10                      0.000000
2018                 3                      62.690000
                     4                     105.000020
                     6                     106.134771
                     7                     118.279304

In [163]:
df_mismatch.shape

(8689, 1)

In [165]:
df_dispatch.shape[0] - df_grouped.shape[0]

8689

In [ ]:
df1 = df.loc[df.PeriodID < pytz.FixedOffset(600).localize(dt.datetime(2018, 8, 1)), :]

In [ ]:
df.PeriodID = df.PeriodID.dt.tz_localize(None)
df.head()